# Groupby

In [1]:
import pandas as pd
import numpy as np

In [2]:
#Groupby
"""
A groupby operation involves some combination of splitting the object, 
applying a function, and combining the results. 
This can be used to group large amounts of data and compute operations on these groups.
"""
#Splitting or Aggregations or Fiteration or Transformation

'\nA groupby operation involves some combination of splitting the object, \napplying a function, and combining the results. \nThis can be used to group large amounts of data and compute operations on these groups.\n'

In [44]:
# create a IPL dataset 
import pandas as pd

ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [46]:
#i want the unique Team Names/find out total teams in dataset
#df["Team"].nunique()
#df["Team"].unique()
df.Team.nunique()

5

In [5]:
#find out the total count (teamwise)
df["Team"].value_counts()

MI        4
CSK       3
Devils    2
Royals    2
Kings     1
Name: Team, dtype: int64

In [50]:
# Fetch only one team record
df.groupby("Team").get_group("MI")

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [58]:
# find the mean of points is MI
# both get the same output
df.groupby("Team").get_group("MI")["Points"].mean()
# df.groupby("Team").get_group("MI").Points.mean()
# df[df["Team"]== "MI"]["Points"].mean()

762.25

In [63]:
# Find the means of points (teamwise)
# df.groupby("Team")["Points"].mean()
# rearange
df.groupby("Team").mean()["Points"]

Team
CSK       785.333333
Devils    768.000000
Kings     741.000000
MI        762.250000
Royals    752.500000
Name: Points, dtype: float64

In [65]:
# find the all mean (teamwise)
df.groupby("Team").mean()

        Rank    Year      Points
Team
CSK     2.00  2016.0  785.333333
Devils  2.50  2014.5  768.000000
Kings   3.00  2014.0  741.000000
MI      1.75  2015.5  762.250000
Royals  2.50  2014.5  752.500000

In [67]:
# it will give index of team present in which index
d = df.groupby("Team").groups
d

{'CSK': [5, 6, 7], 'Devils': [2, 3], 'Kings': [4], 'MI': [0, 1, 8, 11], 'Royals': [9, 10]}

In [68]:
# Fetch the data present in the d. d is dict. fetch value using keys 
d['MI']

Int64Index([0, 1, 8, 11], dtype='int64')

In [69]:
# using loc
df.loc[d['MI']]

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [103]:
# loc work as label
df.loc[:,["Rank"]]
# iloc work as index(integer)
df.iloc[[0,1],[0,1,3]]

  Team  Rank  Points
0   MI     1     876
1   MI     2     789

In [86]:
# using iloc
df.iloc[d['CSK']]

  Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788

In [14]:
# multiple columns groupby
df.groupby(["Team", "Year"]).groups
# return dict. and key is both columns in tuple and value is index

{('CSK', 2015): [5], ('CSK', 2016): [6], ('CSK', 2017): [7], ('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('MI', 2014): [0], ('MI', 2015): [1], ('MI', 2016): [8], ('MI', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10]}

In [105]:
# groupby multiple columns and fetch only specified data, in get_group pass the value in tuple. otherwise raise error.
df.groupby(["Team", "Year"]).get_group(("CSK", 2016))

  Team  Rank  Year  Points
6  CSK     1  2016     756

In [16]:
#Iterating through groups
#Problem statement: Identify yearwise records  from whole dataset
gr = df.groupby("Year")
for v in gr:
    print(v)

(2014,      Team  Rank  Year  Points
0      MI     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701)
(2015,       Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804)
(2016,   Team  Rank  Year  Points
6  CSK     1  2016     756
8   MI     2  2016     694)
(2017,    Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690)

In [17]:
# v[0] is years
for v in gr:
    print(v[0])

2014
2015
2016
2017

In [18]:
# 2016 data  using interation
for v in gr:
    if v[0] == 2016:
        print(v[1])

  Team  Rank  Year  Points
6  CSK     1  2016     756
8   MI     2  2016     694

In [19]:
# typecasting
list(gr)

[(2014,
       Team  Rank  Year  Points
  0      MI     1  2014     876
  2  Devils     2  2014     863
  4   Kings     3  2014     741
  9  Royals     4  2014     701),
 (2015,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  3   Devils     3  2015     673
  5      CSK     4  2015     812
  10  Royals     1  2015     804),
 (2016,
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  8   MI     2  2016     694),
 (2017,
     Team  Rank  Year  Points
  7   CSK     1  2017     788
  11   MI     2  2017     690)]

In [108]:
# using indexing fetch the data
list(gr)[3][1]

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

# fetch record of 2015 without using groupby

In [21]:
df[df["Year"]== 2015]

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [116]:
# query needs expression as single quote string,
#df.query('Team == "MI"')
df.query('Year == 2015')

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [118]:
df[df.loc[:,'Year']==2015]

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

# fetch record of 2015 using groupby

In [121]:
gr = df.groupby("Year").get_group(2015)
gr

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [123]:
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

# Yearwise first entry

In [129]:
df.groupby("Year").first()

     Team  Rank  Points
Year
2014   MI     1     876
2015   MI     2     789
2016  CSK     1     756
2017  CSK     1     788

# Yearwise last entry

In [26]:
df.groupby("Year").last()

        Team  Rank  Points
Year
2014  Royals     4     701
2015  Royals     1     804
2016      MI     2     694
2017      MI     2     690

In [27]:
# want to fetch the data of year =2014
df.groupby("Year").get_group(2014)
list(df.groupby("Year"))[0][1]

     Team  Rank  Year  Points
0      MI     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [28]:
#i want record of year 2017
df.groupby("Year").get_group(2017)
list(df.groupby("Year"))[3][1]

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

In [136]:
# i want the team who stood 1st max times in ipl
df.groupby("Rank").get_group(1)["Team"].value_counts().head(1)

CSK    2
Name: Team, dtype: int64

In [138]:
# i want count of team those rank is 1
df.groupby("Rank").get_group(1) ["Team"].value_counts()

CSK       2
Royals    1
MI        1
Name: Team, dtype: int64

In [31]:
#Aggregations #sum mean median mode std
#Aggregations work only on Numeric fields
#yearwise points summation 
gr = df.groupby("Year")
gr["Points"].agg(np.sum)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [32]:
# here size is nothing but occurance
gr = df.groupby("Year")
gr["Points"].agg(np.size)

Year
2014    4
2015    4
2016    2
2017    2
Name: Points, dtype: int64

In [33]:
# i want the columnwise size
#no. of elements present
df.groupby("Team").agg(np.size)

        Rank  Year  Points
Team
CSK        3     3       3
Devils     2     2       2
Kings      1     1       1
MI         4     4       4
Royals     2     2       2

In [34]:
# i want the rankwise size
df.groupby("Team")["Rank"].agg(np.size)

Team
CSK       3
Devils    2
Kings     1
MI        4
Royals    2
Name: Rank, dtype: int64

In [35]:
# another solution
df.groupby('Team')['Rank'].count()

Team
CSK       3
Devils    2
Kings     1
MI        4
Royals    2
Name: Rank, dtype: int64

In [36]:
#Applying Multiple Aggregation Functions at Once
grouped = df.groupby('Team')
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum        mean         std
Team
CSK     2356  785.333333   28.095077
Devils  1536  768.000000  134.350288
Kings    741  741.000000         NaN
MI      3049  762.250000   88.567771
Royals  1505  752.500000   72.831998

In [37]:
df["Points"]

0     876
1     789
2     863
3     673
4     741
5     812
6     756
7     788
8     694
9     701
10    804
11    690
Name: Points, dtype: int64

In [38]:
#Transformation calling a function over the selected data
grouped = df.groupby('Team')
score = lambda x: (x + 500)
grouped['Points'].transform(score)

0     1376
1     1289
2     1363
3     1173
4     1241
5     1312
6     1256
7     1288
8     1194
9     1201
10    1304
11    1190
Name: Points, dtype: int64

In [39]:
df.groupby('Team')['Points'].transform(lambda x:x+500)

0     1376
1     1289
2     1363
3     1173
4     1241
5     1312
6     1256
7     1288
8     1194
9     1201
10    1304
11    1190
Name: Points, dtype: int64

#  I want to give the +10 extra points to csk use transform

In [40]:
df.groupby("Team").get_group("CSK")["Points"].transform(lambda x: x + 10)

5    822
6    766
7    798
Name: Points, dtype: int64

In [41]:
df[df["Team"]=="CSK"]['Points'].transform(lambda x: x + 10)

5    822
6    766
7    798
Name: Points, dtype: int64

# I want to give extra +10 point only to the teams from year 2015

In [42]:
df.query("Year== 2015")["Points"].transform(lambda x: x + 10)

1     799
3     683
5     822
10    814
Name: Points, dtype: int64